In [3]:
import pandas as pd

df = pd.read_csv("BankMarketing.csv")

df.head()

,age,job,marital,education,default,balance,housing,loan,contact,date,duration,campaign,pdays,previous,poutcome,Purchased?
0,58,management,married,tertiary,no,2143,yes,no,unknown,5/5/2017,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5/5/2017,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5/5/2017,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5/5/2017,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5/5/2017,198,1,-1,0,unknown,no

In [4]:
df.shape

(45211, 16)

In [5]:
df.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'date', 'duration', 'campaign', 'pdays', 'previous',
       'poutcome', 'Purchased?'],
      dtype='object')

In [6]:
df.dtypes

age            int64
job           object
marital       object
education     object
default       object
balance        int64
housing       object
loan          object
contact       object
date          object
duration       int64
campaign       int64
pdays          int64
previous       int64
poutcome      object
Purchased?    object
dtype: object

In [7]:
df.dtypes == "object"

age           False
job            True
marital        True
education      True
default        True
balance       False
housing        True
loan           True
contact        True
date           True
duration      False
campaign      False
pdays         False
previous      False
poutcome       True
Purchased?     True
dtype: bool

In [9]:
a = df.dtypes[df.dtypes == "object"].index
a

Index(['job', 'marital', 'education', 'default', 'housing', 'loan', 'contact',
       'date', 'poutcome', 'Purchased?'],
      dtype='object')

In [10]:
df.describe()

,age,balance,duration,campaign,pdays,previous
count,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000
mean,40.936210,1362.272058,258.163080,2.763841,40.197828,0.580323
std,10.618762,3044.765829,257.527812,3.098021,100.128746,2.303441
min,18.000000,-8019.000000,0.000000,1.000000,-1.000000,0.000000
25%,33.000000,72.000000,103.000000,1.000000,-1.000000,0.000000
50%,39.000000,448.000000,180.000000,2.000000,-1.000000,0.000000
75%,48.000000,1428.000000,319.000000,3.000000,-1.000000,0.000000
max,95.000000,102127.000000,4918.000000,63.000000,871.000000,275.000000

In [11]:
df.isnull().sum()

age           0
job           0
marital       0
education     0
default       0
balance       0
housing       0
loan          0
contact       0
date          0
duration      0
campaign      0
pdays         0
previous      0
poutcome      0
Purchased?    0
dtype: int64

In [12]:
df.rename(columns={'Purchased?': 'purchased'}, inplace=True)

In [13]:
df.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'date', 'duration', 'campaign', 'pdays', 'previous',
       'poutcome', 'purchased'],
      dtype='object')

In [14]:
df['date'] = pd.to_datetime(df['date'])

In [15]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,date,duration,campaign,pdays,previous,poutcome,purchased
0,58,management,married,tertiary,no,2143,yes,no,unknown,2017-05-05,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,2017-05-05,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,2017-05-05,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,2017-05-05,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,2017-05-05,198,1,-1,0,unknown,no

In [16]:
df[df['age'] > 40]

,age,job,marital,education,default,balance,housing,loan,contact,date,duration,campaign,pdays,previous,poutcome,purchased
0,58,management,married,tertiary,no,2143,yes,no,unknown,2017-05-05,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,2017-05-05,151,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,2017-05-05,92,1,-1,0,unknown,no
7,42,entrepreneur,divorced,tertiary,yes,2,yes,no,unknown,2017-05-05,380,1,-1,0,unknown,no
8,58,retired,married,primary,no,121,yes,no,unknown,2017-05-05,50,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45204,73,retired,married,secondary,no,2850,no,no,cellular,2019-11-17,300,1,40,8,failure,yes
45206,51,technician,married,tertiary,no,825,no,no,cellular,2019-11-17,977,3,-1,0,unknown,yes
45207,71,retired,divorced,primary,no,1729,no,no,cellular,2019-11-17,456,2,-1,0,unknown,yes
45208,72,retired,married,secondary,no,5715,no,no,cellular,2019-11-17,1127,5,184,3,success,yes
45209,57,blue-collar,married,secondary,no,668,no,no,telephone,2019-11-17,508,4,-1,0,unknown,no

In [17]:
df[(df['age'] > 40) & (df['balance'] > 2000)]

,age,job,marital,education,default,balance,housing,loan,contact,date,duration,campaign,pdays,previous,poutcome,purchased
0,58,management,married,tertiary,no,2143,yes,no,unknown,2017-05-05,261,1,-1,0,unknown,no
34,51,management,married,tertiary,no,10635,yes,no,unknown,2017-05-05,336,1,-1,0,unknown,no
40,44,services,divorced,secondary,no,2586,yes,no,unknown,2017-05-05,160,1,-1,0,unknown,no
65,51,management,married,tertiary,no,6530,yes,no,unknown,2017-05-05,91,1,-1,0,unknown,no
70,57,blue-collar,married,secondary,no,5935,yes,yes,unknown,2017-05-05,258,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45181,46,blue-collar,married,secondary,no,6879,no,no,cellular,2019-11-15,74,2,118,3,failure,no
45185,60,services,married,tertiary,no,4256,yes,no,cellular,2019-11-16,200,1,92,4,success,yes
45191,75,retired,divorced,tertiary,no,3810,yes,no,cellular,2019-11-16,262,1,183,1,failure,yes
45204,73,retired,married,secondary,no,2850,no,no,cellular,2019-11-17,300,1,40,8,failure,yes
45208,72,retired,married,secondary,no,5715,no,no,cellular,2019-11-17,1127,5,184,3,success,yes

In [18]:
df[['age', 'job', 'balance', 'purchased']]

       age           job  balance purchased
0       58    management     2143        no
1       44    technician       29        no
2       33  entrepreneur        2        no
3       47   blue-collar     1506        no
4       33       unknown        1        no
...    ...           ...      ...       ...
45206   51    technician      825       yes
45207   71       retired     1729       yes
45208   72       retired     5715       yes
45209   57   blue-collar      668        no
45210   37  entrepreneur     2971        no

[45211 rows x 4 columns]

In [19]:
df['balance_category'] = df['balance'].apply(
    lambda x: 'Low' if x < 1000 else 'Medium' if x < 5000 else 'High'
)

In [20]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,date,duration,campaign,pdays,previous,poutcome,purchased,balance_category
0,58,management,married,tertiary,no,2143,yes,no,unknown,2017-05-05,261,1,-1,0,unknown,no,Medium
1,44,technician,single,secondary,no,29,yes,no,unknown,2017-05-05,151,1,-1,0,unknown,no,Low
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,2017-05-05,76,1,-1,0,unknown,no,Low
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,2017-05-05,92,1,-1,0,unknown,no,Medium
4,33,unknown,single,unknown,no,1,no,no,unknown,2017-05-05,198,1,-1,0,unknown,no,Low

In [21]:
df.groupby('job')['balance'].mean()

job
admin.           1135.838909
blue-collar      1078.826654
entrepreneur     1521.470074
housemaid        1392.395161
management       1763.616832
retired          1984.215106
self-employed    1647.970868
services          997.088108
student          1388.060768
technician       1252.632092
unemployed       1521.745971
unknown          1772.357639
Name: balance, dtype: float64

In [22]:
import numpy as np
import pandas as pd

labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

print ("Labels:", labels)
print("My data:", my_data)
print(arr)
print("Dictionary:", d)

Labels: ['a', 'b', 'c']
My data: [10, 20, 30]
[10 20 30]
Dictionary: {'a': 10, 'b': 20, 'c': 30}

In [23]:
pd.Series(my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [24]:
print ("\nHolding numerical data\n",'-'*25, sep='')
print(pd.Series(arr)[0])

Holding numerical data
-------------------------
10

In [25]:
print ("\nHolding text labels\n",'-'*20, sep='')
print(pd.Series(labels))

Holding text labels
--------------------
0    a
1    b
2    c
dtype: object

In [26]:
ser1 = pd.Series([1,2,3,4],index = [2,4,6,8])
ser1

2    1
4    2
6    3
8    4
dtype: int64

In [27]:
ser2 = pd.Series([1,2,5,4],['CA', 'OR', 'NV', 'AZ'])
ser2

CA    1
OR    2
NV    5
AZ    4
dtype: int64

In [28]:
print ("\nIndexing by number (positional value in the series)\n",'-'*52, sep='')
print("Value for CA in ser1:", ser1[2])
print("Value for AZ in ser1:", ser1[4])
print("Value for NV in ser2:", ser2['NV'])

Indexing by number (positional value in the series)
----------------------------------------------------
Value for CA in ser1: 1
Value for AZ in ser1: 2
Value for NV in ser2: 5

In [29]:
ser1 = pd.Series([1,2,3,4],['CA', 'OR', 'CO', 'CA'])
ser2 = pd.Series([1,2,5,4],['CA', 'NV', 'AZ','OR'])
ser3 = ser1+ser2
ser3

AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.0
dtype: float64

In [30]:
from numpy.random import randn as rn
np.random.seed(101)
matrix_data = rn(5,4)
matrix_data
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']

df = pd.DataFrame(matrix_data,row_labels,column_headings)
print("\nThe data frame looks like\n",'-'*45, sep='')
df

The data frame looks like
---------------------------------------------

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [32]:
df.loc['C','W']

np.float64(-2.018168244037392)

In [33]:
print("\nA column is created by assigning it in relation to an existing column\n",'-'*75, sep='')
df['New'] = df['X']+df['Z']
df['New (Sum of X and Z)'] = df['X']+df['Z']
print(df)

A column is created by assigning it in relation to an existing column
---------------------------------------------------------------------------
          W         X         Y         Z       New  New (Sum of X and Z)
A  2.706850  0.628133  0.907969  0.503826  1.131958              1.131958
B  0.651118 -0.319318 -0.848077  0.605965  0.286647              0.286647
C -2.018168  0.740122  0.528813 -0.589001  0.151122              0.151122
D  0.188695 -0.758872 -0.933237  0.955057  0.196184              0.196184
E  0.190794  1.978757  2.605967  0.683509  2.662266              2.662266

In [34]:
print("\nA column is dropped by using df.drop() method\n",'-'*55, sep=' ')
df.drop("A",inplace=True) # Notice the axis=1 option, axis = 0 is default, so one has to change it to 1

A column is dropped by using df.drop() method
 -------------------------------------------------------

In [35]:
df

          W         X         Y         Z       New  New (Sum of X and Z)
B  0.651118 -0.319318 -0.848077  0.605965  0.286647              0.286647
C -2.018168  0.740122  0.528813 -0.589001  0.151122              0.151122
D  0.188695 -0.758872 -0.933237  0.955057  0.196184              0.196184
E  0.190794  1.978757  2.605967  0.683509  2.662266              2.662266

In [36]:
import pandas as pd 
import numpy as np
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']
matrix_data

matrix([[ 22,  66, 140],
        [ 42,  70, 148],
        [ 30,  62, 125],
        [ 35,  68, 160],
        [ 25,  62, 152]])

In [37]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nA new DataFrame\n",'-'*25, sep='')
print(df)

A new DataFrame
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [38]:
print("\nRows with Height > 65 inch\n",'-'*35, sep='')
print(df[df['Height']>65])

Rows with Height > 65 inch
-----------------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     160

In [39]:
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']

In [40]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nThe DataFrame\n",'-'*25, sep='')
print(df)

The DataFrame
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [41]:
print("\nAfter resetting index\n",'-'*35, sep='')
print(df.reset_index())

After resetting index
-----------------------------------
  index  Age  Height  Weight
0     A   22      66     140
1     B   42      70     148
2     C   30      62     125
3     D   35      68     160
4     E   25      62     152

In [42]:
print("\nAfter resetting index with 'drop' option TRUE\n",'-'*45, sep='')
print(df.reset_index(drop=True))
"Student Teacher Engineer Doctor Nurse".split()

After resetting index with 'drop' option TRUE
---------------------------------------------
   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

['Student', 'Teacher', 'Engineer', 'Doctor', 'Nurse']

In [43]:
print("\nAdding a new column 'Profession'\n",'-'*45, sep='')
df['Profession'] = "Student Teacher Engineer Doctor Nurse".split()
print(df)

Adding a new column 'Profession'
---------------------------------------------
   Age  Height  Weight Profession
A   22      66     140    Student
B   42      70     148    Teacher
C   30      62     125   Engineer
D   35      68     160     Doctor
E   25      62     152      Nurse

In [44]:
print("\nSetting 'Profession' column as index\n",'-'*45, sep='')
print (df.set_index('Profession'))

Setting 'Profession' column as index
---------------------------------------------
            Age  Height  Weight
Profession
Student      22      66     140
Teacher      42      70     148
Engineer     30      62     125
Doctor       35      68     160
Nurse        25      62     152